RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_vbat.h
#if (defined(FSL_FEATURE_MCX_VBAT_HAS_TAMPER_REG) && FSL_FEATURE_MCX_VBAT_HAS_TAMPER_REG)
/*! @name Tamper Control Interfaces
 *
 */

/*!
 * @brief Initialize tamper control.
 *
 * @note Both FRO16K and bandgap should be enabled before calling this function.
 *
 * @param base VBAT peripheral base address.
 * @param config Pointer to @ref vbat_tamper_config_t structure.
 *
 * @retval kStatus_Success Tamper is initialized successfully.
 * @retval kStatus_VBAT_TamperLocked Tamper control is locked.
 * @retval kStatus_VBAT_BandgapNotEnabled Bandgap is not enabled.
 * @retval kStatus_VBAT_Fro16kNotEnabled FRO 16K is not enabled.
 */
status_t VBAT_InitTamper(VBAT_Type *base, const vbat_tamper_config_t *config);

/*!
 * @brief De-initialize tamper control.
 *
 * @param base VBAT peripheral base address.
 *
 * @retval kStatus_Success Tamper is de-initialized successfully.
 * @retval kStatus_VBAT_TamperLocked Tamper control is locked.
 */
status_t VBAT_DeinitTamper(VBAT_Type *base);

/*!
 * @brief Enable tampers for VBAT.
 *
 * @param base VBAT peripheral base address.
 * @param tamperEnableMask Mask of tamper to be enabled, should be the OR'ed value of @ref _vbat_tamper_enable.
 */
static inline void VBAT_EnableTamper(VBAT_Type *base, uint32_t tamperEnableMask)
{
    base->TAMPERA |= tamperEnableMask;
    base->TAMPERB &= ~tamperEnableMask;
}

/*!
 * @brief Disable tampers for VBAT.
 *
 * @param base VBAT peripheral base address.
 * @param tamperEnableMask Mask of tamper to be disabled, should be the OR'ed value of @ref _vbat_tamper_enable.
 */
static inline void VBAT_DisableTamper(VBAT_Type *base, uint32_t tamperEnableMask)
{
    base->TAMPERA &= ~tamperEnableMask;
    base->TAMPERB |= tamperEnableMask;
}

/*!
 * @brief Get tamper enable information.
 *
 * @param base VBAT peripheral base address.
 *
 * @return Mask of tamper enable information, should be the OR'ed value of @ref _vbat_tamper_enable.
 */
static inline uint32_t VBAT_GetTamperEnableInfo(VBAT_Type *base)
{
    return base->TAMPERA;
}

/*!
 * @brief Lock tamper control, if locked, it is not allowed to change tamper control.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_LockTamperControl(VBAT_Type *base)
{
    base->TAMLCKA |= VBAT_TAMLCKA_LOCK_MASK;
    base->TAMLCKB &= ~VBAT_TAMLCKA_LOCK_MASK;
}

/*!
 * @brief Unlock tamper control.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_UnlockTamperControl(VBAT_Type *base)
{
    base->TAMLCKA &= ~VBAT_TAMLCKA_LOCK_MASK;
    base->TAMLCKB |= VBAT_TAMLCKA_LOCK_MASK;
}

/*!
 * @brief Check if tamper control is locked.
 *
 * @param base VBAT peripheral base address.
 *
 * @retval false Tamper control is not locked.
 * @retval true  Tamper control is locked, any writes to related registers are blocked.
 */
static inline bool VBAT_CheckTamperControlLocked(VBAT_Type *base)
{
    return ((base->TAMLCKA & VBAT_TAMLCKA_LOCK_MASK) != 0UL);
}

/*! @} */
#endif /* FSL_FEATURE_VBAT_HAS_TAMPER */

#if (defined(FSL_FEATURE_MCX_VBAT_HAS_STATUS_REG) && FSL_FEATURE_MCX_VBAT_HAS_STATUS_REG)
/*! @name Status, Interrupt, Wakeup Control Interfaces
 * @{
 */

/*!
 * @brief Get VBAT status flags
 *
 * @param base VBAT peripheral base address.
 * @return The asserted status flags, should be the OR'ed value of @ref vbat_status_flag_t.
 */
static inline uint32_t VBAT_GetStatusFlags(VBAT_Type *base)
{
    return (uint32_t)(base->STATUSA);
}

/*!
 * @brief Clear VBAT status flags.
 *
 * @param base VBAT peripheral base address.
 * @param mask The mask of status flags to be cleared, should be the OR'ed value of @ref vbat_status_flag_t except
 *              @ref kVBAT_StatusFlagLdoReady, @ref kVBAT_StatusFlagOsc32kReady, @ref kVBAT_StatusFlagInterrupt0Detect,
 *              @ref kVBAT_StatusFlagInterrupt1Detect, @ref kVBAT_StatusFlagInterrupt2Detect,
 *              @ref kVBAT_StatusFlagInterrupt3Detect.
 */
static inline void VBAT_ClearStatusFlags(VBAT_Type *base, uint32_t mask)
{
    base->STATUSA = mask;
    base->STATUSB = ~mask;
}

/*!
 * @brief Enable interrupts for the VBAT module, such as POR detect interrupt, Wakeup Pin interrupt and so on.
 *
 * @param base VBAT peripheral base address.
 * @param mask The mask of interrupts to be enabled, should be the OR'ed value of @ref vbat_interrupt_enable_t.
 */
static inline void VBAT_EnableInterrupts(VBAT_Type *base, uint32_t mask)
{
    base->IRQENA |= mask;
    base->IRQENB &= (uint32_t)~mask;
}

/*!
 * @brief Disable interrupts for the VBAT module, such as POR detect interrupt, wakeup pin interrupt and so on.
 *
 * @param base VBAT peripheral base address.
 * @param mask The mask of interrupts to be disabled, should be the OR'ed value of @ref vbat_interrupt_enable_t.
 */
static inline void VBAT_DisableInterrupts(VBAT_Type *base, uint32_t mask)
{
    base->IRQENA &= ~mask;
    base->IRQENB |= mask;
}

/*!
 * @brief Enable wakeup for the VBAT module, such as POR detect wakeup, wakeup pin wakeup and so on.
 *
 * @param base VBAT peripheral base address.
 * @param mask The mask of enumerators in @ref vbat_wakeup_enable_t.
 */
static inline void VBAT_EnableWakeup(VBAT_Type *base, uint32_t mask)
{
    base->WAKENA |= mask;
    base->WAKENB &= ~mask;
}

/*!
 * @brief Disable wakeup for VBAT module, such as POR detect wakeup, wakeup pin wakeup and so on.
 *
 * @param base VBAT peripheral base address.
 * @param mask The mask of enumerators in @ref vbat_wakeup_enable_t.
 */
static inline void VBAT_DisableWakeup(VBAT_Type *base, uint32_t mask)
{
    base->WAKENA &= ~mask;
    base->WAKENB |= mask;
}

/*!
 * @brief Lock VBAT interrupt and wakeup settings, please note that if locked the interrupt and wakeup settings can not
 * be updated until the next POR.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_LockInterruptWakeupSettings(VBAT_Type *base)
{
    base->LOCKA |= VBAT_LOCKA_LOCK_MASK;
}

/*!
 * @brief Set the default state of the WAKEUP_b pin output when no enabled wakeup source is asserted.
 *
 * @param base VBAT peripheral base address.
 * @param assert Used to set default state of the WAKEUP_b pin output:
 *          - \b true WAKEUP_b output state is logic one;
 *          - \b false WAKEUP_b output state is logic zero.
 */
static inline void VBAT_SetWakeupPinDefaultState(VBAT_Type *base, bool assert)
{
    if (assert)
    {
        base->WAKECFG |= VBAT_WAKECFG_OUT_MASK;
    }
    else
    {
        base->WAKECFG &= ~VBAT_WAKECFG_OUT_MASK;
    }
}

/*! @} */
#endif /* FSL_FEATURE_MCX_VBAT_HAS_STATUS_REG */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* __FSL_VBAT_H__ */
